import "./Home.css";

function Home() {
  return (
    <>
      <div className="home-container">
        <div className="home-content">
          <h1 className="home-header">Добро пожаловать в мое портфолио</h1>
          <p className="home-text">
            Привет! Меня зовут Василий, и я начинающий веб-разработчик с
            горящими глазами и страстью к созданию цифровых решений. Мой путь в
            IT начался с занятий с репетитором и постепенно перерос в серьезное
            увлечение. За последние 1.5 года я освоил ключевые технологии
            современной веб-разработки: React, JavaScript, HTML5/CSS3 и основы
            Node.js.В работе ценю чистый
            читаемый код и стараюсь следовать принципам DRY и KISS. Уверенно
            использую Git для контроля версий и Figma для работы с макетами.
            Сейчас углубленно изучаю React. Мои
            сильные стороны: Упорство в решении сложных задач Внимание к деталям
            интерфейсов Стремление разобраться в глубинных механизмах работы
            технологий В этом портфолио собраны проекты, которые демонстрируют
            мой прогресс — от простых лендингов до [укажите самый сложный
            проект]. Каждая работа сопровождается подробным описанием
            используемых технологий и решенных проблем. Как начинающий
            разработчик, я открыт для интересных предложений и готов к
            нестандартным задачам, которые помогут мне расти профессионально.
            Верю, что сочетание технических навыков, обучаемости и творческого
            подхода делает меня ценным участником IT-команд. Всегда рад новым
            знакомствам в профессиональном сообществе!
          </p>  
        </div>
      </div>
    </>
  );
}

export default Home;
